{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          2
        ],
        "tokens": [
          "</s>"
        ]
      },
      "<s>": {
        "id": "<s>",
        "ids": [
          0
        ],
        "tokens": [
          "<s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      "+": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "<": 30,
      "=": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "A": 35,
      "B": 36,
      "C": 37,
      "D": 38,
      "E": 39,
      "F": 40,
      "G": 41,
      "H": 42,
      "I": 43,
      "J": 44,
      "K": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "Q": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "^": 64,
      "_": 65,
      "`": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "j": 76,
      "k": 77,
      "l": 78,
      "m": 79,
      "n": 80,
      "o": 81,
      "p": 82,
      "q": 83,
      "r": 84,
      "s": 85,
      "t": 86,
      "u": 87,
      "v": 88,
      "w": 89,
      "x": 90,
      "y": 91,
      "z": 92,
      "{": 93,
      "|": 94,
      "}": 95,
      "~": 96,
      "Ċ": 97,
      "Ġ": 98,
      "Ġ}": 99,
      "Ġ{": 100,
      "Ġ\\": 101,
      "Ġ_": 102,
      "Ġ^": 103,
      "Ġ)": 104,
      "Ġ(": 105,
      "Ġ1": 106,
      "ma": 107,
      "Ġ2": 108,
      "Ġ,": 109,
      "th": 110,
      "math": 111,
      "Ġ0": 112,
      "Ġ=": 113,
      "Ġ-": 114,
      "ra": 115,
      "Ġi": 116,
      "Ġ+": 117,
      "ta": 118,
      "Ġ.": 119,
      "ar": 120,
      "Ġn": 121,
      "me": 122,
      "in": 123,
      "Ġt": 124,
      "Ġ~": 125,
      "le": 126,
      "al": 127,
      "ri": 128,
      "Ġr": 129,
      "Ġx": 130,
      "fra": 131,
      "mathr": 132,
      "mathrm": 133,
      "frac": 134,
      "Ġk": 135,
      "Ġa": 136,
      "Ġ3": 137,
      "Ġe": 138,
      "si": 139,
      "mathb": 140,
      "Ġs": 141,
      "Ġm": 142,
      "Ġd": 143,
      "ft": 144,
      "eta": 145,
      "ph": 146,
      "am": 147,
      "ray": 148,
      "array": 149,
      "Ġl": 150,
      "ti": 151,
      "Ġp": 152,
      "Ġ|": 153,
      "Ġ4": 154,
      "de": 155,
      "Ġc": 156,
      "Ġj": 157,
      "gh": 158,
      "righ": 159,
      "Ġ&": 160,
      "cal": 161,
      "mathcal": 162,
      "left": 163,
      "right": 164,
      "Ġ/": 165,
      "mathbf": 166,
      "pri": 167,
      "prime": 168,
      "Ġf": 169,
      "Ġ5": 170,
      "ot": 171,
      "Ġu": 172,
      "ĠT": 173,
      "dot": 174,
      "to": 175,
      "Ġy": 176,
      "lta": 177,
      "da": 178,
      "pha": 179,
      "ĠR": 180,
      "ĠA": 181,
      "ĠN": 182,
      "Ġh": 183,
      "alpha": 184,
      "Ġb": 185,
      "psi": 186,
      "Ġv": 187,
      "lo": 188,
      "Ġo": 189,
      "Ġ6": 190,
      "ĠS": 191,
      "Ġg": 192,
      "Ġz": 193,
      "bda": 194,
      "ambda": 195,
      "ĠL": 196,
      "ĠM": 197,
      "eg": 198,
      "Ġ]": 199,
      "nd": 200,
      "beg": 201,
      "end": 202,
      "begin": 203,
      "amma": 204,
      "ĠC": 205,
      "gma": 206,
      "ĠB": 207,
      "Ġq": 208,
      "mu": 209,
      "ga": 210,
      "mega": 211,
      "Ġ[": 212,
      "ĠP": 213,
      "Ġ8": 214,
      "phi": 215,
      "ĠE": 216,
      "su": 217,
      "ng": 218,
      "Ġ7": 219,
      "lambda": 220,
      "ĠX": 221,
      "ĠH": 222,
      "pi": 223,
      "mathbb": 224,
      "ngle": 225,
      "sigma": 226,
      "lon": 227,
      "psilon": 228,
      "lde": 229,
      "tilde": 230,
      "Ġ9": 231,
      "epsilon": 232,
      "ĠD": 233,
      "ĠF": 234,
      "ĠV": 235,
      "theta": 236,
      "Ġ*": 237,
      "bo": 238,
      "bol": 239,
      "beta": 240,
      "ho": 241,
      "mes": 242,
      "times": 243,
      "gamma": 244,
      "ĠI": 245,
      "rho": 246,
      "ĠG": 247,
      "Ġw": 248,
      "Ġ\\}": 249,
      "sum": 250,
      "delta": 251,
      "ve": 252,
      "na": 253,
      "var": 254,
      "pm": 255,
      "tau": 256,
      "rt": 257,
      "Ġ\\\\": 258,
      "la": 259,
      "bar": 260,
      "par": 261,
      "ig": 262,
      "op": 263,
      "Ġ:": 264,
      "dots": 265,
      "ĠK": 266,
      "omega": 267,
      "ge": 268,
      "tial": 269,
      "partial": 270,
      "ll": 271,
      "ap": 272,
      "De": 273,
      "Delta": 274,
      "Ġ<": 275,
      "sq": 276,
      "nu": 277,
      "sqrt": 278,
      "Ġ\\{": 279,
      "qu": 280,
      "hi": 281,
      "era": 282,
      "rna": 283,
      "torna": 284,
      "opera": 285,
      "torname": 286,
      "operatorname": 287,
      "ĠU": 288,
      "rangle": 289,
      "ell": 290,
      "ĠQ": 291,
      "cdot": 292,
      "inft": 293,
      "infty": 294,
      "ro": 295,
      "ĠW": 296,
      "ĠZ": 297,
      "big": 298,
      "app": 299,
      "Ġ\\|": 300,
      "int": 301,
      "xi": 302,
      "Ġ>": 303,
      "ĠY": 304,
      "sy": 305,
      "sym": 306,
      "ĠJ": 307,
      "symbol": 308,
      "dsymbol": 309,
      "boldsymbol": 310,
      "se": 311,
      "set": 312,
      "Omega": 313,
      "lin": 314,
      "line": 315,
      "rline": 316,
      "ad": 317,
      "quad": 318,
      "Gamma": 319,
      "ĠO": 320,
      "langle": 321,
      "ide": 322,
      "wide": 323,
      "sim": 324,
      "\\{": 325,
      "varepsilon": 326,
      "ove": 327,
      "Ġ;": 328,
      "vec": 329,
      "log": 330,
      "overline": 331,
      "varphi": 332,
      "chi": 333,
      "kapp": 334,
      "kappa": 335,
      "Phi": 336,
      "Lambda": 337,
      "st": 338,
      "co": 339,
      "Big": 340,
      "bset": 341,
      "subset": 342,
      "tar": 343,
      "Si": 344,
      "Sigma": 345,
      "bla": 346,
      "nabla": 347,
      "widetilde": 348,
      "row": 349,
      "mathfra": 350,
      "mathfrak": 351,
      "up": 352,
      "iv": 353,
      "zeta": 354,
      "ex": 355,
      "equ": 356,
      "equiv": 357,
      "rox": 358,
      "approx": 359,
      "cos": 360,
      "cdots": 361,
      "sf": 362,
      "mathsf": 363,
      "rc": 364,
      "sin": 365,
      "otimes": 366,
      "us": 367,
      "cap": 368,
      "cup": 369,
      "at": 370,
      "hat": 371,
      "widehat": 372,
      "ci": 373,
      "circ": 374,
      "dag": 375,
      "ne": 376,
      "Psi": 377,
      "exp": 378,
      "ln": 379,
      "ger": 380,
      "dagger": 381,
      "tarrow": 382,
      "qquad": 383,
      "ast": 384,
      "\\|": 385,
      "eq": 386,
      "pt": 387,
      "meq": 388,
      "simeq": 389,
      "nde": 390,
      "unde": 391,
      "er": 392,
      "Th": 393,
      "Theta": 394,
      "Ġ?": 395,
      "yle": 396,
      "style": 397,
      "\\}": 398,
      "Pi": 399,
      "rightarrow": 400,
      "min": 401,
      "bigg": 402,
      "minus": 403,
      "Ġ!": 404,
      "setminus": 405,
      "star": 406,
      "subseteq": 407,
      "Ve": 408,
      "di": 409,
      "pr": 410,
      "per": 411,
      "perp": 412,
      "Vert": 413,
      "rod": 414,
      "prod": 415,
      "or": 416,
      "fo": 417,
      "hbar": 418,
      "underline": 419,
      "rall": 420,
      "forall": 421,
      "dge": 422,
      "edge": 423,
      "wedge": 424,
      "sla": 425,
      "it": 426,
      "mathit": 427,
      "lus": 428,
      "sc": 429,
      "mi": 430,
      "mid": 431,
      "oplus": 432,
      "ck": 433,
      "ript": 434,
      "script": 435,
      "lle": 436,
      "top": 437,
      "opto": 438,
      "propto": 439,
      "tt": 440,
      "ps": 441,
      "psto": 442,
      "odot": 443,
      "not": 444,
      "mapsto": 445,
      "ts": 446,
      "gets": 447,
      "tex": 448,
      "text": 449,
      "flo": 450,
      "floor": 451,
      "sp": 452,
      "ss": 453,
      "less": 454,
      "lesssim": 455,
      "ystyle": 456,
      "laystyle": 457,
      "disp": 458,
      "displaystyle": 459,
      "nt": 460,
      "qsla": 461,
      "qslant": 462,
      "sh": 463,
      "mathtt": 464,
      "bin": 465,
      "om": 466,
      "binom": 467,
      "em": 468,
      "yset": 469,
      "ptyset": 470,
      "emptyset": 471,
      "arrow": 472,
      "parrow": 473,
      "ow": 474,
      "own": 475,
      "uparrow": 476,
      "down": 477,
      "vee": 478,
      "gg": 479,
      "cong": 480,
      "downarrow": 481,
      "vert": 482,
      "vartheta": 483,
      "ngrightarrow": 484,
      "angle": 485,
      "re": 486,
      "rset": 487,
      "bigl": 488,
      "scriptstyle": 489,
      "bu": 490,
      "llet": 491,
      "bullet": 492,
      "bigr": 493,
      "leqslant": 494,
      "io": 495,
      "iota": 496,
      "tri": 497,
      "triangle": 498,
      "ara": 499,
      "para": 500,
      "llel": 501,
      "parallel": 502,
      "Xi": 503,
      "dim": 504,
      "il": 505,
      "eil": 506,
      "nto": 507,
      "phanto": 508,
      "phantom": 509,
      "longrightarrow": 510,
      "lfloor": 511,
      "sta": 512,
      "ckre": 513,
      "stackre": 514,
      "stackrel": 515,
      "Ġ\\#": 516,
      "bigcup": 517,
      "rfloor": 518,
      "notin": 519,
      "slash": 520,
      "Ġ\\_": 521,
      "varrho": 522,
      "Bigg": 523,
      "textup": 524,
      "Ġ'": 525,
      "tan": 526,
      "scriptscriptstyle": 527,
      "ack": 528,
      "back": 529,
      "backslash": 530,
      "mal": 531,
      "he": 532,
      "ec": 533,
      "nor": 534,
      "normal": 535,
      "mo": 536,
      "textnormal": 537,
      "che": 538,
      "check": 539,
      "tin": 540,
      "tiny": 541,
      "deg": 542,
      "cosh": 543,
      "Upsilon": 544,
      "mp": 545,
      "overset": 546,
      "sinh": 547,
      "prec": 548,
      "Ri": 549,
      "ghtarrow": 550,
      "Rightarrow": 551,
      "vdots": 552,
      "underset": 553,
      "leftrightarrow": 554,
      "Bigl": 555,
      "triangleq": 556,
      "bot": 557,
      "over": 558,
      "geqslant": 559,
      "ddot": 560,
      "xrightarrow": 561,
      "Bigr": 562,
      "xist": 563,
      "xists": 564,
      "rceil": 565,
      "mathop": 566,
      "exists": 567,
      "ceil": 568,
      "lceil": 569,
      "varpi": 570,
      "neg": 571,
      "sma": 572,
      "ze": 573,
      "size": 574,
      "arp": 575,
      "textstyle": 576,
      "bmo": 577,
      "bmod": 578,
      "Re": 579,
      "bra": 580,
      "sup": 581,
      "upsilon": 582,
      "supset": 583,
      "ce": 584,
      "brace": 585,
      "overrightarrow": 586,
      "arg": 587,
      "cc": 588,
      "succ": 589,
      "Ġ--": 590,
      "ker": 591,
      "rbrace": 592,
      "underbrace": 593,
      "Lo": 594,
      "sharp": 595,
      "small": 596,
      "scriptsize": 597,
      "bigoplus": 598,
      "ls": 599,
      "dels": 600,
      "models": 601,
      "dash": 602,
      "sqcup": 603,
      "no": 604,
      "varsigma": 605,
      "ok": 606,
      "hook": 607,
      "bigcap": 608,
      "Longrightarrow": 609,
      "hookrightarrow": 610,
      "bre": 611,
      "breve": 612,
      "Im": 613,
      "preceq": 614,
      "arc": 615,
      "imath": 616,
      "thin": 617,
      "varno": 618,
      "thing": 619,
      "varnothing": 620,
      "od": 621,
      "pmod": 622,
      "vdash": 623,
      "Le": 624,
      "\\#": 625,
      "ftrightarrow": 626,
      "Leftrightarrow": 627,
      "oint": 628,
      "cot": 629,
      "inter": 630,
      "intercal": 631,
      "arctan": 632,
      "ftarrow": 633,
      "ddots": 634,
      "ond": 635,
      "amond": 636,
      "diamond": 637,
      "bigwedge": 638,
      "fla": 639,
      "flat": 640,
      "supseteq": 641,
      "rtimes": 642,
      "succeq": 643,
      "AA": 644,
      "ni": 645,
      "Ġ\\*": 646,
      "ect": 647,
      "otect": 648,
      "protect": 649,
      "wp": 650,
      "doteq": 651,
      "el": 652,
      "mathrel": 653,
      "asym": 654,
      "asymp": 655,
      "vphantom": 656,
      "ff": 657,
      "iff": 658,
      "ut": 659,
      "lg": 660,
      "mathor": 661,
      "mathord": 662,
      "leftarrow": 663,
      "Ġ~~": 664,
      "Ġ\\&": 665,
      "Vec": 666,
      "iint": 667,
      "lefteq": 668,
      "lefteqn": 669,
      "ngleftrightarrow": 670,
      "smash": 671,
      "Ġ\"": 672,
      "bigvee": 673,
      "bigotimes": 674,
      "smallsetminus": 675,
      "jmath": 676,
      "esize": 677,
      "otnot": 678,
      "footnot": 679,
      "footnotesize": 680,
      "atop": 681,
      "Ġ\\/": 682,
      "mathbin": 683,
      "subsetne": 684,
      "subsetneq": 685,
      "coth": 686,
      "ac": 687,
      "ute": 688,
      "acute": 689,
      "tharp": 690,
      "tharpo": 691,
      "tharpoo": 692,
      "cfrac": 693,
      "Ġ@": 694,
      "div": 695,
      "bigtriangle": 696,
      "overleftarrow": 697,
      "gmapsto": 698,
      "longmapsto": 699,
      "ale": 700,
      "aleph": 701,
      "sqsubseteq": 702,
      "Bb": 703,
      "bk": 704,
      "Bbbk": 705,
      "ominus": 706,
      "cop": 707,
      "coprod": 708,
      "arcsin": 709,
      "Longleftrightarrow": 710,
      "nup": 711,
      "tharpoonup": 712,
      "rightharpoonup": 713,
      "hphantom": 714,
      "ohe": 715,
      "tw": 716,
      "adrightarrow": 717,
      "oheadrightarrow": 718,
      "twoheadrightarrow": 719,
      "tu": 720,
      "ral": 721,
      "natu": 722,
      "natural": 723,
      "bigsqcup": 724,
      "li": 725,
      "lim": 726,
      "triangleright": 727,
      "eqno": 728,
      "bigtriangleup": 729,
      "jlim": 730,
      "ip": 731,
      "kip": 732,
      "skip": 733,
      "searrow": 734,
      "arge": 735,
      "suit": 736,
      "ddagger": 737,
      "sec": 738,
      "Ġ`": 739,
      "Vdash": 740,
      "longleftrightarrow": 741,
      "Ġ\\%": 742,
      "ngleftarrow": 743,
      "wr": 744,
      "longleftarrow": 745,
      "uplus": 746,
      "Da": 747,
      "vDa": 748,
      "vDash": 749,
      "triangleleft": 750,
      "hf": 751,
      "sb": 752,
      "nearrow": 753,
      "overbrace": 754,
      "eth": 755,
      "sqcap": 756,
      "Ġ\\-": 757,
      "overleftrightarrow": 758,
      "ill": 759,
      "csc": 760,
      "hfill": 761,
      "varDelta": 762,
      "Ġ---": 763,
      "amal": 764,
      "amalg": 765,
      "rut": 766,
      "strut": 767,
      "wti": 768,
      "bowti": 769,
      "bowtie": 770,
      "frow": 771,
      "frown": 772,
      "varOmega": 773,
      "large": 774,
      "pro": 775,
      "varpro": 776,
      "varprojlim": 777,
      "ou": 778,
      "pou": 779,
      "nds": 780,
      "pounds": 781,
      "xleftarrow": 782,
      "\\*": 783,
      "bigtriangledown": 784,
      "ddag": 785,
      "en": 786,
      "enskip": 787,
      "Down": 788,
      "Downarrow": 789,
      "dashv": 790,
      "rd": 791,
      "surd": 792,
      "injlim": 793,
      "varinjlim": 794,
      "bigcirc": 795,
      "lap": 796,
      "sl": 797,
      "SS": 798,
      "diamondsuit": 799,
      "rb": 800,
      "verb": 801,
      "Uparrow": 802,
      "lef": 803,
      "Large": 804,
      "--": 805,
      "mathstrut": 806,
      "cdotp": 807,
      "det": 808,
      "gra": 809,
      "grave": 810,
      "rlap": 811,
      "ns": 812,
      "rightlef": 813,
      "tharpoons": 814,
      "rightleftharpoons": 815,
      "sqsubset": 816,
      "ment": 817,
      "lement": 818,
      "comp": 819,
      "complement": 820,
      "dskip": 821,
      "medskip": 822,
      "Leftarrow": 823,
      "side": 824,
      "sideset": 825,
      "asu": 826,
      "measu": 827,
      "dangle": 828,
      "redangle": 829,
      "measuredangle": 830,
      "tsuit": 831,
      "artsuit": 832,
      "heartsuit": 833,
      "Pr": 834,
      "oslash": 835,
      "oin": 836,
      "normalsize": 837,
      "Join": 838,
      "bigstar": 839,
      "bigm": 840,
      "max": 841,
      "brack": 842,
      "mho": 843,
      "iiint": 844,
      "warrow": 845,
      "AR": 846,
      "GE": 847,
      "LAR": 848,
      "LARGE": 849,
      "box": 850,
      "smi": 851,
      "smile": 852,
      "smallskip": 853,
      "updownarrow": 854,
      "null": 855,
      "beth": 856,
      "nexists": 857,
      "\\%": 858,
      "vline": 859,
      "spa": 860,
      "bsuit": 861,
      "cl": 862,
      "ubsuit": 863,
      "clubsuit": 864,
      "ef": 865,
      "ther": 866,
      "ore": 867,
      "efore": 868,
      "therefore": 869,
      "desuit": 870,
      "spadesuit": 871,
      "eri": 872,
      "sph": 873,
      "calangle": 874,
      "ericalangle": 875,
      "sphericalangle": 876,
      "fbox": 877,
      "nwarrow": 878,
      "sqsupseteq": 879,
      "swarrow": 880,
      "\\_": 881,
      "llap": 882,
      "ref": 883,
      "---": 884,
      "hookleftarrow": 885,
      "hfil": 886,
      "uge": 887,
      "Bigm": 888,
      "gi": 889,
      "mel": 890,
      "gimel": 891,
      "ebox": 892,
      "kebox": 893,
      "makebox": 894,
      "au": 895,
      "bec": 896,
      "ause": 897,
      "because": 898,
      "cd": 899,
      "gcd": 900,
      "leth": 901,
      "daleth": 902,
      "leftharpoonup": 903,
      "sqsupset": 904,
      "\\-": 905,
      "Huge": 906,
      "ondown": 907,
      "tharpoondown": 908,
      "huge": 909,
      "ij": 910,
      "\\&": 911,
      "inf": 912,
      "rightharpoondown": 913,
      "roup": 914,
      "nleftrightarrow": 915,
      "Longleftarrow": 916,
      "mebox": 917,
      "framebox": 918,
      "bump": 919,
      "bumpeq": 920,
      "lgroup": 921,
      "group": 922,
      "rgroup": 923,
      "\\/": 924,
      "space": 925,
      "hspace": 926,
      "fill": 927,
      "Ġ#": 928,
      "Up": 929,
      "Updownarrow": 930,
      "do": 931,
      "limsup": 932,
      "ointop": 933,
      "leftharpoondown": 934,
      "backepsilon": 935,
      "~~": 936,
      "Ġ\\]": 937,
      "minf": 938,
      "liminf": 939,
      "Ġ\\[": 940,
      "def": 941,
      "Fin": 942,
      "Finv": 943,
      "bj": 944,
      "bject": 945,
      "\\]": 946,
      "object": 947,
      "ĠObject": 948,
      "llde": 949,
      "nullde": 950,
      "erspace": 951,
      "iterspace": 952,
      "limiterspace": 953,
      "nulldelimiterspace": 954
    },
    "merges": [
      "Ġ }",
      "Ġ {",
      "Ġ \\",
      "Ġ _",
      "Ġ ^",
      "Ġ )",
      "Ġ (",
      "Ġ 1",
      "m a",
      "Ġ 2",
      "Ġ ,",
      "t h",
      "ma th",
      "Ġ 0",
      "Ġ =",
      "Ġ -",
      "r a",
      "Ġ i",
      "Ġ +",
      "t a",
      "Ġ .",
      "a r",
      "Ġ n",
      "m e",
      "i n",
      "Ġ t",
      "Ġ ~",
      "l e",
      "a l",
      "r i",
      "Ġ r",
      "Ġ x",
      "f ra",
      "math r",
      "mathr m",
      "fra c",
      "Ġ k",
      "Ġ a",
      "Ġ 3",
      "Ġ e",
      "s i",
      "math b",
      "Ġ s",
      "Ġ m",
      "Ġ d",
      "f t",
      "e ta",
      "p h",
      "a m",
      "ra y",
      "ar ray",
      "Ġ l",
      "t i",
      "Ġ p",
      "Ġ |",
      "Ġ 4",
      "d e",
      "Ġ c",
      "Ġ j",
      "g h",
      "ri gh",
      "Ġ &",
      "c al",
      "math cal",
      "le ft",
      "righ t",
      "Ġ /",
      "mathb f",
      "p ri",
      "pri me",
      "Ġ f",
      "Ġ 5",
      "o t",
      "Ġ u",
      "Ġ T",
      "d ot",
      "t o",
      "Ġ y",
      "l ta",
      "d a",
      "ph a",
      "Ġ R",
      "Ġ A",
      "Ġ N",
      "Ġ h",
      "al pha",
      "Ġ b",
      "p si",
      "Ġ v",
      "l o",
      "Ġ o",
      "Ġ 6",
      "Ġ S",
      "Ġ g",
      "Ġ z",
      "b da",
      "am bda",
      "Ġ L",
      "Ġ M",
      "e g",
      "Ġ ]",
      "n d",
      "b eg",
      "e nd",
      "beg in",
      "am ma",
      "Ġ C",
      "g ma",
      "Ġ B",
      "Ġ q",
      "m u",
      "g a",
      "me ga",
      "Ġ [",
      "Ġ P",
      "Ġ 8",
      "ph i",
      "Ġ E",
      "s u",
      "n g",
      "Ġ 7",
      "l ambda",
      "Ġ X",
      "Ġ H",
      "p i",
      "mathb b",
      "ng le",
      "si gma",
      "lo n",
      "psi lon",
      "l de",
      "ti lde",
      "Ġ 9",
      "e psilon",
      "Ġ D",
      "Ġ F",
      "Ġ V",
      "th eta",
      "Ġ *",
      "b o",
      "bo l",
      "b eta",
      "h o",
      "me s",
      "ti mes",
      "g amma",
      "Ġ I",
      "r ho",
      "Ġ G",
      "Ġ w",
      "Ġ\\ }",
      "su m",
      "de lta",
      "v e",
      "n a",
      "v ar",
      "p m",
      "ta u",
      "r t",
      "Ġ\\ \\",
      "l a",
      "b ar",
      "p ar",
      "i g",
      "o p",
      "Ġ :",
      "dot s",
      "Ġ K",
      "o mega",
      "g e",
      "ti al",
      "par tial",
      "l l",
      "a p",
      "D e",
      "De lta",
      "Ġ <",
      "s q",
      "n u",
      "sq rt",
      "Ġ\\ {",
      "q u",
      "h i",
      "e ra",
      "r na",
      "to rna",
      "op era",
      "torna me",
      "opera torname",
      "Ġ U",
      "ra ngle",
      "e ll",
      "Ġ Q",
      "c dot",
      "in ft",
      "inft y",
      "r o",
      "Ġ W",
      "Ġ Z",
      "b ig",
      "ap p",
      "Ġ\\ |",
      "in t",
      "x i",
      "Ġ >",
      "Ġ Y",
      "s y",
      "sy m",
      "Ġ J",
      "sym bol",
      "d symbol",
      "bol dsymbol",
      "s e",
      "se t",
      "O mega",
      "l in",
      "lin e",
      "r line",
      "a d",
      "qu ad",
      "G amma",
      "Ġ O",
      "la ngle",
      "i de",
      "w ide",
      "si m",
      "\\ {",
      "var epsilon",
      "o ve",
      "Ġ ;",
      "ve c",
      "lo g",
      "ove rline",
      "var phi",
      "c hi",
      "k app",
      "kapp a",
      "P hi",
      "L ambda",
      "s t",
      "c o",
      "B ig",
      "b set",
      "su bset",
      "ta r",
      "S i",
      "Si gma",
      "b la",
      "na bla",
      "wide tilde",
      "ro w",
      "math fra",
      "mathfra k",
      "u p",
      "i v",
      "z eta",
      "e x",
      "e qu",
      "equ iv",
      "ro x",
      "app rox",
      "co s",
      "c dots",
      "s f",
      "math sf",
      "r c",
      "s in",
      "o times",
      "u s",
      "c ap",
      "c up",
      "a t",
      "h at",
      "wide hat",
      "c i",
      "ci rc",
      "da g",
      "n e",
      "P si",
      "ex p",
      "l n",
      "ge r",
      "dag ger",
      "tar row",
      "q quad",
      "a st",
      "\\ |",
      "e q",
      "p t",
      "me q",
      "si meq",
      "n de",
      "u nde",
      "e r",
      "T h",
      "Th eta",
      "Ġ ?",
      "y le",
      "st yle",
      "\\ }",
      "P i",
      "righ tarrow",
      "m in",
      "big g",
      "min us",
      "Ġ !",
      "set minus",
      "s tar",
      "subset eq",
      "V e",
      "d i",
      "p r",
      "p er",
      "per p",
      "Ve rt",
      "ro d",
      "p rod",
      "o r",
      "f o",
      "h bar",
      "unde rline",
      "ra ll",
      "fo rall",
      "d ge",
      "e dge",
      "w edge",
      "s la",
      "i t",
      "math it",
      "l us",
      "s c",
      "m i",
      "mi d",
      "op lus",
      "c k",
      "ri pt",
      "sc ript",
      "l le",
      "to p",
      "op to",
      "pr opto",
      "t t",
      "p s",
      "ps to",
      "o dot",
      "n ot",
      "ma psto",
      "t s",
      "ge ts",
      "t ex",
      "tex t",
      "f lo",
      "flo or",
      "s p",
      "s s",
      "le ss",
      "less sim",
      "y style",
      "la ystyle",
      "di sp",
      "disp laystyle",
      "n t",
      "q sla",
      "qsla nt",
      "s h",
      "math tt",
      "b in",
      "o m",
      "bin om",
      "e m",
      "y set",
      "pt yset",
      "em ptyset",
      "ar row",
      "par row",
      "o w",
      "ow n",
      "u parrow",
      "d own",
      "ve e",
      "g g",
      "co ng",
      "down arrow",
      "ve rt",
      "var theta",
      "ng rightarrow",
      "a ngle",
      "r e",
      "r set",
      "big l",
      "script style",
      "b u",
      "lle t",
      "bu llet",
      "big r",
      "le qslant",
      "i o",
      "io ta",
      "t ri",
      "tri angle",
      "a ra",
      "p ara",
      "lle l",
      "para llel",
      "X i",
      "di m",
      "i l",
      "e il",
      "n to",
      "pha nto",
      "phanto m",
      "lo ngrightarrow",
      "l floor",
      "s ta",
      "ck re",
      "sta ckre",
      "stackre l",
      "Ġ\\ #",
      "big cup",
      "r floor",
      "not in",
      "sla sh",
      "Ġ\\ _",
      "var rho",
      "Big g",
      "text up",
      "Ġ '",
      "ta n",
      "script scriptstyle",
      "a ck",
      "b ack",
      "back slash",
      "ma l",
      "h e",
      "e c",
      "n or",
      "nor mal",
      "m o",
      "text normal",
      "c he",
      "che ck",
      "t in",
      "tin y",
      "de g",
      "cos h",
      "U psilon",
      "m p",
      "ove rset",
      "sin h",
      "pr ec",
      "R i",
      "gh tarrow",
      "Ri ghtarrow",
      "v dots",
      "unde rset",
      "left rightarrow",
      "Big l",
      "triangle q",
      "b ot",
      "ove r",
      "ge qslant",
      "d dot",
      "x rightarrow",
      "Big r",
      "xi st",
      "xist s",
      "rc eil",
      "math op",
      "e xists",
      "c eil",
      "l ceil",
      "var pi",
      "n eg",
      "s ma",
      "z e",
      "si ze",
      "ar p",
      "text style",
      "b mo",
      "bmo d",
      "R e",
      "b ra",
      "su p",
      "u psilon",
      "sup set",
      "c e",
      "bra ce",
      "over rightarrow",
      "ar g",
      "c c",
      "su cc",
      "Ġ- -",
      "k er",
      "r brace",
      "unde rbrace",
      "L o",
      "sh arp",
      "sma ll",
      "script size",
      "big oplus",
      "l s",
      "de ls",
      "mo dels",
      "da sh",
      "sq cup",
      "n o",
      "var sigma",
      "o k",
      "ho ok",
      "big cap",
      "Lo ngrightarrow",
      "hook rightarrow",
      "b re",
      "bre ve",
      "I m",
      "prec eq",
      "ar c",
      "i math",
      "th in",
      "var no",
      "thin g",
      "varno thing",
      "o d",
      "pm od",
      "v dash",
      "L e",
      "\\ #",
      "ft rightarrow",
      "Le ftrightarrow",
      "o int",
      "c ot",
      "int er",
      "inter cal",
      "arc tan",
      "f tarrow",
      "d dots",
      "o nd",
      "am ond",
      "di amond",
      "big wedge",
      "f la",
      "fla t",
      "supset eq",
      "r times",
      "succ eq",
      "A A",
      "n i",
      "Ġ\\ *",
      "ec t",
      "ot ect",
      "pr otect",
      "w p",
      "dot eq",
      "e l",
      "mathr el",
      "a sym",
      "asym p",
      "v phantom",
      "f f",
      "i ff",
      "u t",
      "l g",
      "math or",
      "mathor d",
      "le ftarrow",
      "Ġ~ ~",
      "Ġ\\ &",
      "Ve c",
      "i int",
      "left eq",
      "lefteq n",
      "ng leftrightarrow",
      "sma sh",
      "Ġ \"",
      "big vee",
      "big otimes",
      "small setminus",
      "j math",
      "e size",
      "ot not",
      "fo otnot",
      "footnot esize",
      "a top",
      "Ġ\\ /",
      "mathb in",
      "subset ne",
      "subsetne q",
      "co th",
      "a c",
      "ut e",
      "ac ute",
      "th arp",
      "tharp o",
      "tharpo o",
      "c frac",
      "Ġ @",
      "d iv",
      "big triangle",
      "over leftarrow",
      "gma psto",
      "lon gmapsto",
      "a le",
      "ale ph",
      "sq subseteq",
      "B b",
      "b k",
      "Bb bk",
      "o minus",
      "c op",
      "cop rod",
      "arc sin",
      "Lo ngleftrightarrow",
      "nu p",
      "tharpoo nup",
      "righ tharpoonup",
      "h phantom",
      "o he",
      "t w",
      "ad rightarrow",
      "ohe adrightarrow",
      "tw oheadrightarrow",
      "t u",
      "ra l",
      "na tu",
      "natu ral",
      "big sqcup",
      "l i",
      "li m",
      "triangle right",
      "eq no",
      "bigtriangle up",
      "j lim",
      "i p",
      "k ip",
      "s kip",
      "se arrow",
      "ar ge",
      "su it",
      "d dagger",
      "se c",
      "Ġ `",
      "V dash",
      "lo ngleftrightarrow",
      "Ġ\\ %",
      "ngle ftarrow",
      "w r",
      "lo ngleftarrow",
      "up lus",
      "D a",
      "v Da",
      "vDa sh",
      "triangle left",
      "h f",
      "s b",
      "ne arrow",
      "over brace",
      "e th",
      "sq cap",
      "Ġ\\ -",
      "over leftrightarrow",
      "i ll",
      "c sc",
      "hf ill",
      "var Delta",
      "Ġ-- -",
      "a mal",
      "amal g",
      "r ut",
      "st rut",
      "w ti",
      "bo wti",
      "bowti e",
      "f row",
      "frow n",
      "var Omega",
      "l arge",
      "p ro",
      "var pro",
      "varpro jlim",
      "o u",
      "p ou",
      "nd s",
      "pou nds",
      "x leftarrow",
      "\\ *",
      "bigtriangle down",
      "d dag",
      "e n",
      "en skip",
      "D own",
      "Down arrow",
      "dash v",
      "r d",
      "su rd",
      "in jlim",
      "var injlim",
      "big circ",
      "la p",
      "s l",
      "S S",
      "diamond suit",
      "r b",
      "ve rb",
      "U parrow",
      "le f",
      "L arge",
      "- -",
      "math strut",
      "cdot p",
      "de t",
      "g ra",
      "gra ve",
      "r lap",
      "n s",
      "right lef",
      "tharpoo ns",
      "rightlef tharpoons",
      "sq subset",
      "me nt",
      "le ment",
      "co mp",
      "comp lement",
      "d skip",
      "me dskip",
      "Le ftarrow",
      "si de",
      "side set",
      "a su",
      "me asu",
      "da ngle",
      "re dangle",
      "measu redangle",
      "t suit",
      "ar tsuit",
      "he artsuit",
      "P r",
      "o slash",
      "o in",
      "normal size",
      "J oin",
      "big star",
      "big m",
      "ma x",
      "bra ck",
      "m ho",
      "i iint",
      "w arrow",
      "A R",
      "G E",
      "L AR",
      "LAR GE",
      "bo x",
      "s mi",
      "smi le",
      "small skip",
      "up downarrow",
      "nu ll",
      "b eth",
      "ne xists",
      "\\ %",
      "v line",
      "sp a",
      "b suit",
      "c l",
      "u bsuit",
      "cl ubsuit",
      "e f",
      "th er",
      "or e",
      "ef ore",
      "ther efore",
      "de suit",
      "spa desuit",
      "e ri",
      "s ph",
      "cal angle",
      "eri calangle",
      "sph ericalangle",
      "f box",
      "n warrow",
      "sq supseteq",
      "s warrow",
      "\\ _",
      "l lap",
      "re f",
      "-- -",
      "hook leftarrow",
      "hf il",
      "u ge",
      "Big m",
      "g i",
      "me l",
      "gi mel",
      "e box",
      "k ebox",
      "ma kebox",
      "a u",
      "b ec",
      "au se",
      "bec ause",
      "c d",
      "g cd",
      "le th",
      "da leth",
      "lef tharpoonup",
      "sq supset",
      "\\ -",
      "H uge",
      "ond own",
      "tharpo ondown",
      "h uge",
      "i j",
      "\\ &",
      "in f",
      "righ tharpoondown",
      "ro up",
      "n leftrightarrow",
      "Lo ngleftarrow",
      "me box",
      "fra mebox",
      "bu mp",
      "bump eq",
      "lg roup",
      "g roup",
      "r group",
      "\\ /",
      "spa ce",
      "h space",
      "f ill",
      "Ġ #",
      "U p",
      "Up downarrow",
      "d o",
      "lim sup",
      "oin top",
      "lef tharpoondown",
      "back epsilon",
      "~ ~",
      "Ġ\\ ]",
      "min f",
      "li minf",
      "Ġ\\ [",
      "de f",
      "F in",
      "Fin v",
      "b j",
      "bj ect",
      "\\ ]",
      "o bject",
      "ĠO bject",
      "l lde",
      "nu llde",
      "er space",
      "it erspace",
      "lim iterspace",
      "nullde limiterspace"
    ]
  }
}